Module 4 Project 2

Jordan Wheeler

In [33]:
import pandas as pd

In [34]:
grades_dict = {'Wally': [87, 96, 70], 'Eva': [100, 87, 90], 
               'Sam': [94, 77, 90], 'Katie': [100, 81, 82],
               'Bob': [83, 65, 85]}

grades = pd.DataFrame(grades_dict)

grades

   Wally  Eva  Sam  Katie  Bob
0     87  100   94    100   83
1     96   87   77     81   65
2     70   90   90     82   85

Task 2: Custom Index

In [35]:
grades.index = ['Test 1', 'Test 2', 'Test 3']

In [36]:
grades

        Wally  Eva  Sam  Katie  Bob
Test 1     87  100   94    100   83
Test 2     96   87   77     81   65
Test 3     70   90   90     82   85

In [37]:
# Eva's Grades
grades['Eva']

Test 1    100
Test 2     87
Test 3     90
Name: Eva, dtype: int64

In [38]:
# Sam's Grades
grades.Sam

Test 1    94
Test 2    77
Test 3    90
Name: Sam, dtype: int64

Task 3: Accessing Rows (loc, iloc)

In [39]:
# Get Test 1

grades.loc['Test 1']

Wally     87
Eva      100
Sam       94
Katie    100
Bob       83
Name: Test 1, dtype: int64

In [40]:
grades.iloc[1]

Wally    96
Eva      87
Sam      77
Katie    81
Bob      65
Name: Test 2, dtype: int64

In [41]:
# Both provide easy benefits. I think that they will both have their uses.

In [42]:
# Get slices of rows

grades.loc['Test 1':'Test 3']

        Wally  Eva  Sam  Katie  Bob
Test 1     87  100   94    100   83
Test 2     96   87   77     81   65
Test 3     70   90   90     82   85

In [43]:
grades.iloc[0:2]

        Wally  Eva  Sam  Katie  Bob
Test 1     87  100   94    100   83
Test 2     96   87   77     81   65

Task 3: Accessing Subsets

In [44]:
# Eva's Second Score

grades.at['Test 2', 'Eva']

87

In [45]:
# Wally's Slice

grades.iat[2,0]

70

Task 4: Describe by Column

In [46]:
# Descriptive Statistics
pd.set_option('display.precision', 2)

grades.describe()

       Wally     Eva    Sam   Katie    Bob
count   3.00    3.00   3.00    3.00   3.00
mean   84.33   92.33  87.00   87.67  77.67
std    13.20    6.81   8.89   10.69  11.02
min    70.00   87.00  77.00   81.00  65.00
25%    78.50   88.50  83.50   81.50  74.00
50%    87.00   90.00  90.00   82.00  83.00
75%    91.50   95.00  92.00   91.00  84.00
max    96.00  100.00  94.00  100.00  85.00

Task 5: Transpose

In [47]:
# Use Mean

grades.mean()

Wally    84.33
Eva      92.33
Sam      87.00
Katie    87.67
Bob      77.67
dtype: float64

In [48]:
# Transpose DataFrame

grades.T.describe()

       Test 1  Test 2  Test 3
count    5.00    5.00    5.00
mean    92.80   81.20   83.40
std      7.66   11.54    8.23
min     83.00   65.00   70.00
25%     87.00   77.00   82.00
50%     94.00   81.00   85.00
75%    100.00   87.00   90.00
max    100.00   96.00   90.00

Task 6: Sort

In [49]:
# Sort in reverse order

grades.sort_index(ascending=False)

        Wally  Eva  Sam  Katie  Bob
Test 3     70   90   90     82   85
Test 2     96   87   77     81   65
Test 1     87  100   94    100   83

In [50]:
# Sort Columns by name

grades.sort_index(axis=1)

        Bob  Eva  Katie  Sam  Wally
Test 1   83  100    100   94     87
Test 2   65   87     81   77     96
Test 3   85   90     82   90     70